
#if 0
澳大利亚的父母喜欢女孩，如果生出来的第一个是女孩，就不再生了，如果是男孩就继续生，直到生到第一个女孩为止，问若干年后，男女的比例是多少？

如果生出来的第一个是女孩，就不再生了，如果是男孩就继续生，直到生到第一个女孩为止。若设某家庭的baby数为X，随机变量X应符合几何分布。

p(X=1)= 1/2：第一个就是女孩；

p(X=2) = 1/2 * 1/2：第一个是男孩，第二个是女孩；

p(X=3) = (1/2)^2 * 1/2：前两个是男孩，最后一个是女孩；

……

p(X=n) = (1/2)^(n-1) * 1/2；

几何分布的期望EX=1/p，方差DX=（1-p）/p^2。

由此得知：E(X) = 1/(1/2) = 2;

这就表示，平均每个家庭有两个孩子。

为了清楚起见，我们设女孩个数为随机变量Y，则：

E(Y) = 1*p(x=1) + 1* p(x=2) + 1 * p(x=3) + …… = 1/2 + (1/2)^2 + (1/2)^3 + …… = (1/2) * (1/(1-1/2)) = 1

也就是说，最终每个家庭平均有1个女孩，有E(X)-E(Y)=2-1=1个男孩。

因此若干年后男女比例为1:1。至于中国的父母喜欢生男孩，与澳大利亚的情况相反，为什么男女比例差距这么大？我想，可能是因为人工干预太多。
#endif
