
#if 0
其实任何推理的源泉都在于简化。所以推理过程是这样的：
从后向前推，如果１－３号强盗都喂了鲨鱼，只剩４号和５号的话，５号一定投
反对票让４号喂鲨鱼，以独吞全部金币。所以，４号惟有支持３号才能保命。
３号知道这一点，就会提（１００，０，０）的分配方案，对４号、５号一毛不
拔而将全部金币归为已有，因为他知道４号一无所获但还是会投赞成票，再加上
自己一票，他的方案即可通过。
不过，２号推知到３号的方案，就会提出（９８，０，１，１）的方案，即放弃
３号，而给予４号和５号各一枚金币。
由于该方案对于４号和５号来说比在３号分配时更为有利，他们将支持他而不希
望他出局而由３号来分配。这样，２号将拿走９８枚金币。



不过，２号的方案会被１号所洞悉，１号并将提出（９７，０，１，２，０）或
（９７，０，１，０，２）的方案，即放弃２号，而给３号一枚金币，同时给４
号（或５号）２枚金币。
由于１号的这一方案对于３号和４号（或５号）来说，相比２号分配时更优，他
们将投１号的赞成票，再加上１号自己的票，１号的方案可获通过，９７枚金币
可轻松落入囊中。这无疑是１号能够获取最大收益的方案了！
正确分配方法为（97，0，1，0，2）或者是（97，0，1，2，0）



第一个版本：
有5个海盗，按照等级从5到1排列。最大的海盗有权提议他们如何分享100枚金币。但其
他人要对此表决，如果多数反对，那他就会被杀死。他应该提出怎样的方案，既让自己拿到
尽可能多的金币又不会被杀死？

答案：98,0,1,0,1

你反向思考就行了，从倒数第2个开始。
给人员编号
1，2，3，4，5

5 我要是能拿到1个就满足了
4 当然是  100%了，因为自己肯定是支持，，所以5 关心自己能拿到至少一个金币的方案
3 99个给5一个，这样5肯定会支持，否则4就会拿到所有的，他就一个都拿不到了。4则
关心自己能拿到金币的方案
2 99个，给4一个，这样2:2, 4如果不支持，就只能一个都拿不到，所以会支持你。而3和
5则关心能拿到一个的方案
1 需要2个支持，给3和5，他们肯定会支持，否则他们将一个都拿不到。

据说有一个原则，相邻是冤家，冤家的冤家就是朋友，


第二个版本


有5个海盗，按照等级从5到1排列。最大的海盗有权提议他们如何分享100枚金币。但其
他人要对此表决，如果方案得到超过半数的人同意，则按照他的方案进行，否则那他就会
被杀死。他应该提出怎样的方案，既让自己拿到尽可能多的金币又不会被杀死？

给人员编号
1，2，3，4，5

5 不说了，就他一个人了
4 无论怎么分，5都会反对，所以他为了活命，必须支持3号的任何分发，否则就会因为无
法得到半数以上的支持而死掉
3 自己100，因为4 肯定会支持他，所以会被通过，4和5则关心能否拿到一个的方案
2 无论怎么分，3都会反对，所以他必须给4和5每个人一个，否则他们任何一个人反对，
都会被杀  98,0,1,1,而3则关心自己能拿到一个的方案，而4，5则关心能拿到2个的方案，
因为他们肯定能拿到一个。
1 需要得到2个支持，从利益最大化看，可以给3号1个，给4或者5号2个，97,0,1,2,0 或
者  97,0,1,0,2
3肯定支持，否则2号分配，他啥都得不到
4/5肯定支持，否则2分配，他们最多拿到一个
#endif
